
Функция ОстатокПоСчету(Счет, Период)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрБухУчетОстатки.СуммаРазвернутыйОстатокДт,
		|	РегистрБухУчетОстатки.СуммаРазвернутыйОстатокКт
		|ИЗ
		|	РегистрБухгалтерии.РегистрБухУчет.Остатки(&Период, Счет = &Счет, ) КАК РегистрБухУчетОстатки";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Счет", Счет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Если Счет.Вид = ВидСчета.Активный Тогда
		Возврат ВыборкаДетальныеЗаписи.СуммаРазвернутыйОстатокДт;
	Иначе
		Возврат ВыборкаДетальныеЗаписи.СуммаРазвернутыйОстатокКт;
	КонецЕсли;
		
		
		
		
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	  КонецПериода = КонецМесяца(Дата) + 1;
	  
	  ОстатокВыручка = ОстатокПоСчету(ПланыСчетов.БухгалтерскийУчет.Выручка, КонецПериода);
	  ОстатокСебестоимость = ОстатокПоСчету(ПланыСчетов.БухгалтерскийУчет.Себестоимость, КонецПериода);
	  
	  Движения.РегистрБухУчет.Записывать = Истина;
	  
	  Проводка = Движения.РегистрБухУчет.Добавить();
	  Проводка.Период = Дата;
	  Проводка.СчетДт = ПланыСчетов.БухгалтерскийУчет.Выручка;
	  Проводка.СчетКт = ПланыСчетов.БухгалтерскийУчет.Прибыль;
	  Проводка.Сумма = ОстатокВыручка;
	  
	  Проводка = Движения.РегистрБухУчет.Добавить();
	  Проводка.Период = Дата;
	  Проводка.СчетДт = ПланыСчетов.БухгалтерскийУчет.Прибыль;
	  Проводка.СчетКт = ПланыСчетов.БухгалтерскийУчет.Себестоимость;
	  Проводка.Сумма = ОстатокСебестоимость;



	
КонецПроцедуры
