
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// регистр ЗаработнаяПлата
	Движения.ЗаработнаяПлата.Записывать = Истина;
	Для Каждого ТекСтрокаПремирование Из Премирование Цикл
		Движение = Движения.ЗаработнаяПлата.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.Начисления.ПремияСуммой;
		Движение.ПериодДействияНачало = НачалоМесяца(ДатаПремирования);
		Движение.ПериодДействияКонец = КонецМесяца(ДатаПремирования);
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрокаПремирование.Сотрудник;
		Движение.Сумма = ТекСтрокаПремирование.СуммаПремии;  
		
		
		Движения.ВыплатаЗП.Записывать = Истина;
		Движение = Движения.ВыплатаЗП.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаПремирование.Сотрудник;
		Движение.Сумма = ТекСтрокаПремирование.СуммаПремии;
    	
	КонецЦикла;


КонецПроцедуры
