
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ЗработнаяПлата
	Движения.ЗработнаяПлата.Записывать = Истина;
	Движение = Движения.ЗработнаяПлата.Добавить();
	Движение.Сторно = Ложь;
	Движение.ВидРасчета = ПланыВидовРасчета.Начисления.Оклад;
	Движение.ПериодДействияНачало = НачалоМесяца(Дата);
	Движение.ПериодДействияКонец = КонецМесяца(Дата);
	Движение.ПериодРегистрации = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.РасчетныеДанные = Сумма;
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗработнаяПлатаДанныеГрафика.РасчетныеДанные,
		|	ЗработнаяПлатаДанныеГрафика.РабочийДеньПериодДействия КАК Норма,
		|	ЗработнаяПлатаДанныеГрафика.РабочийДеньФактическийПериодДействия КАК Факт
		|ИЗ
		|	РегистрРасчета.ЗработнаяПлата.ДанныеГрафика(Регистратор = &Регистратор) КАК ЗработнаяПлатаДанныеГрафика";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий(); 
		
		Если ВыборкаДетальныеЗаписи.Норма <> 0 Тогда
			Оклад = ВыборкаДетальныеЗаписи.РасчетныеДанные * ВыборкаДетальныеЗаписи.Факт/ВыборкаДетальныеЗаписи.Норма;
			Движение.Сумма = Оклад;
			Движения.ЗработнаяПлата.Записать(); 
			
			Движения.ДолгиПоЗаработнойПдате.Записывать = Истина;
			Движение = Движения.ДолгиПоЗаработнойПдате.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Сотрудник = Сотрудник;
			Движение.Сумма = Оклад;

		Иначе
			Сообщить("Неверно заполнен график");
		КонецЕсли;	
			
	КонецЕсли;
	
	
	
КонецПроцедуры
