Перем СчастливоеЧисло;

Процедура УсловныеОператоры()
	
	Если СчастливоеЧисло >= 800 И СчастливоеЧисло <= 1000 Тогда
		Сообщить("Счастливое число входит в диапазон от 800 до 1000.");
	КонецЕсли;

	Если СчастливоеЧисло < 800 ИЛИ СчастливоеЧисло > 1000 Тогда       
		Сообщить("Счастливое число не входит в диапазон от 800 до 1000.");
	КонецЕсли;

	Если НЕ (СчастливоеЧисло > 1000) Тогда       
		Сообщить("Счастливое число меньше или равно 1000.");
	КонецЕсли;
	
	Если СчастливоеЧисло = 777 Тогда
		Сообщить("Все правильно!");
	ИначеЕсли СчастливоеЧисло = 888 Тогда
		Сообщить("Восьмерки");
	Иначе
		Сообщить("Ошибка при установке значения!");
	КонецЕсли;
	
	Если СчастливоеЧисло >= 800 И СчастливоеЧисло <= 1000 Тогда
		Сообщить("Счастливое число входит в диапазон от 800 до 1000.");
	КонецЕсли;

	Если СчастливоеЧисло < 800 ИЛИ СчастливоеЧисло > 1000 Тогда       
		Сообщить("Счастливое число не входит в диапазон от 800 до 1000.");
	КонецЕсли;

	Если НЕ (СчастливоеЧисло > 1000) Тогда       
		Сообщить("Счастливое число меньше или равно 1000.");
	КонецЕсли;

КонецПроцедуры

Процедура ЦиклическиеОператоры()
	
	ИскомоеЧисло = 1;
	
	Пока ИскомоеЧисло*ИскомоеЧисло<30000  Цикл
	//Продолжить;
	//Прервать;
		ИскомоеЧисло = ИскомоеЧисло + 1;
	КонецЦикла;

	Сообщить(ИскомоеЧисло-1);
	
	Сообщить(КвадратыЧисел(10,15));
		
КонецПроцедуры

Функция КвадратыЧисел(НачальноеЗначение, КонечноеЗначение)
	
	СуммаКвадратов = 0;
	
	Для Сч = НачальноеЗначение по КонечноеЗначение Цикл 
		Сообщить(Сч);
		Сообщить(Сч*Сч);
		СуммаКвадратов = СуммаКвадратов + Сч*Сч;
	КонецЦикла;
	
	Возврат СуммаКвадратов;
КонецФункции

Процедура Приветствие()
	Сообщить("Привет, 1С!");
	Сообщить("Hello, 1С!");
	
КонецПроцедуры

Процедура РаботаСоСтроками()
	
	Строка1 = "   Привет";
	Строка2 = "мир 1С!   ";
	ИтоговаяСтрока = Строка1 + ", " + Строка2;
	Сообщить(ИтоговаяСтрока);
	Сообщить(СокрЛП(ИтоговаяСтрока));
	Сообщить(СтрДлина(ИтоговаяСтрока));
	Сообщить(СтрДлина(СокрЛП(ИтоговаяСтрока)));
	СтрокаБезПробелов = СокрЛП(ИтоговаяСтрока);
	Сообщить(СтрДлина(СтрокаБезПробелов));
	Сообщить(СтрЗаменить(ИтоговаяСтрока, "!", "!!!"));
	
КонецПроцедуры

Процедура РаботаСДатой()
	
	Сообщить(ТекущаяДата());
	Сообщить(ТекущаяДата()+3600);
	Сообщить(ТекущаяДата()+24*3600);
	Сообщить(КонецМесяца(ТекущаяДата()));
	Сообщить(ДобавитьМесяц(ТекущаяДата(),3));

КонецПроцедуры

Процедура РаботаСЧислами()
	
	Сообщить(СчастливоеЧисло/3);
	Сообщить(СчастливоеЧисло%3);
	Сообщить(СчастливоеЧисло/26);
	Сообщить(Цел(СчастливоеЧисло/33));
	Результат = СчастливоеЧисло/26;
	Сообщить(Окр(Результат));
	
КОнецПроцедуры

Процедура РаботаСБулево()
		
	ЗаданноеБулево = Ложь;
	Сообщить(ЗаданноеБулево);
	ЗаданноеБулево = Не ЗаданноеБулево;
	Сообщить(ЗаданноеБулево);
	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
	ТекущаяДата1800 = КонецДня(ТекущаяДата()) - 5*3600 + 1;
	
	Если ТекущаяДата() < ТекущаяДата1800 Тогда
		Сообщить("Еще не пора домой!");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры




СчастливоеЧисло = 777;
//Сообщить(СчастливоеЧисло); 
СчастливоеЧисло = 888;  
//Сообщить(СчастливоеЧисло); 

//УсловныеОператоры();
//ЦиклическиеОператоры();
//Приветствие();
//РаботаСоСтроками();
//РаботаСДатой();
//РаботаСЧислами();









