
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ЗработнаяПлата
	Движения.ЗработнаяПлата.Записывать = Истина;
	Движение = Движения.ЗработнаяПлата.Добавить();
	Движение.Сторно = Ложь;
	Движение.ВидРасчета = ВидРасчета;
	Движение.ПериодДействияНачало = НачалоМесяца(Дата);
	Движение.ПериодДействияКонец = КонецМесяца(Дата);
	Движение.ПериодРегистрации = Дата;
	Движение.БазовыйПериодНачало = БазовыйПериодНачало; 
	Движение.БазовыйПериодКонец = КонецДня(БазовыйПериодОкончание);
	Движение.ПериодРегистрации = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.РасчетныеДанные = Процент;  
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗработнаяПлатаБазаЗработнаяПлата.СуммаБаза,
		|	ЗработнаяПлатаБазаЗработнаяПлата.РасчетныеДанные
		|ИЗ
		|	РегистрРасчета.ЗработнаяПлата.БазаЗработнаяПлата(&Измерения, &Измерения, , Регистратор = &Ссылка) КАК ЗработнаяПлатаБазаЗработнаяПлата";
	
	
	Измерения = Новый Массив;  
	Измерения.Добавить("Сотрудник");
	
	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой()Тогда
		
			
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();   
		
		Премия = ВыборкаДетальныеЗаписи.СуммаБаза * ВыборкаДетальныеЗаписи.РасчетныеДанные / 100; 
		Движение.Сумма = Премия;
		Движения.ЗработнаяПлата.Записать();
		
		Движения.ДолгиПоЗаработнойПдате.Записывать = Истина;
		Движение = Движения.ДолгиПоЗаработнойПдате.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Сотрудник;
		Движение.Сумма = Премия;

		
	КонецЕсли;

КонецПроцедуры
