Перем СчастливоеЧисло;

//Сообщить("Привет, 1С!");
//Сообщить("Hello, 1С!");

СчастливоеЧисло = 777;
//Сообщить(СчастливоеЧисло); 
СчастливоеЧисло = 888;  
//Сообщить(СчастливоеЧисло); 

Если СчастливоеЧисло = 777 Тогда
	
	Сообщить("Все правильно!");
	
ИначеЕсли СчастливоеЧисло = 888 Тогда
	
	Сообщить("Восьмерки");
	
Иначе
	
	Сообщить("Ошибка при установке значения!");

КонецЕсли;


Для Сч = 15 по 20 Цикл 
	Сообщить(Сч);
	Сообщить(Сч*Сч);
КонецЦикла;               

ИскомоеЧисло = 1;
Пока ИскомоеЧисло*ИскомоеЧисло<30000  Цикл
	//Продолжить;
	//Прервать;
	ИскомоеЧисло = ИскомоеЧисло + 1;
КонецЦикла;

Сообщить(ИскомоеЧисло-1);