
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗработнаяПлатаФактическийПериодДействия.Сотрудник,
		|	ЗработнаяПлатаФактическийПериодДействия.ВидРасчета,
		|	ЗработнаяПлатаФактическийПериодДействия.ПериодДействияНачало,
		|	ЗработнаяПлатаФактическийПериодДействия.ПериодДействияКонец
		|ИЗ
		|	РегистрРасчета.ЗработнаяПлата.ФактическийПериодДействия КАК ЗработнаяПлатаФактическийПериодДействия";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Точка = ДиаграммаГанта.УстановитьТочку(ВыборкаДетальныеЗаписи.Сотрудник);
		Серия = ДиаграммаГанта.УстановитьСерию(ВыборкаДетальныеЗаписи.ВидРасчета);
		
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = ВыборкаДетальныеЗаписи.ПериодДействияНачало;
		Интервал.Конец = ВыборкаДетальныеЗаписи.ПериодДействияКонец;
		
	КонецЦикла;
	


КонецПроцедуры
