//Перем СчастливоеЧисло;

//Сообщить("Привет, 1С!");
//Сообщить("Hello, 1С!");

//СчастливоеЧисло = 777;
//Сообщить(СчастливоеЧисло); 
//СчастливоеЧисло = 888;  
//Сообщить(СчастливоеЧисло); 

//Если СчастливоеЧисло = 777 Тогда
//	
//	Сообщить("Все правильно!");
//	
//ИначеЕсли СчастливоеЧисло = 888 Тогда
//	
//	Сообщить("Восьмерки");
//	
//Иначе
//	
//	Сообщить("Ошибка при установке значения!");

//КонецЕсли;


//Для Сч = 15 по 20 Цикл 
//	Сообщить(Сч);
//	Сообщить(Сч*Сч);
//КонецЦикла;               

//ИскомоеЧисло = 1;
//Пока ИскомоеЧисло*ИскомоеЧисло<30000  Цикл
//	//Продолжить;
//	//Прервать;
//	ИскомоеЧисло = ИскомоеЧисло + 1;
//КонецЦикла;

//Сообщить(ИскомоеЧисло-1);

//Если СчастливоеЧисло >= 800 И СчастливоеЧисло <= 1000 Тогда
//	Сообщить("Счастливое число входит в диапазон от 800 до 1000.");
//КонецЕсли;

//Если СчастливоеЧисло < 800 ИЛИ СчастливоеЧисло > 1000 Тогда       
//	Сообщить("Счастливое число не входит в диапазон от 800 до 1000.");
//КонецЕсли;

//Если НЕ (СчастливоеЧисло > 1000) Тогда       
//	Сообщить("Счастливое число меньше или равно 1000.");
//КонецЕсли;

//Строка1 = "   Привет";
//Строка2 = "мир 1С!   ";
//ИтоговаяСтрока = Строка1 + ", " + Строка2;
//Сообщить(ИтоговаяСтрока);
//Сообщить(СокрЛП(ИтоговаяСтрока));
//Сообщить(СтрДлина(ИтоговаяСтрока));
//Сообщить(СтрДлина(СокрЛП(ИтоговаяСтрока)));
//СтрокаБезПробелов = СокрЛП(ИтоговаяСтрока);
//Сообщить(СтрДлина(СтрокаБезПробелов));
//Сообщить(СтрЗаменить(ИтоговаяСтрока, "!", "!!!"));

//Сообщить(СчастливоеЧисло/3);
//Сообщить(СчастливоеЧисло%3);
//Сообщить(СчастливоеЧисло/26);
//Сообщить(Цел(СчастливоеЧисло/33));
//Результат = СчастливоеЧисло/26;
//Сообщить(Окр(Результат));

//Сообщить(ТекущаяДата());
//Сообщить(ТекущаяДата()+3600);
//Сообщить(ТекущаяДата()+24*3600);

//ЗаданноеБулево = Ложь;
//Сообщить(ЗаданноеБулево);
//ЗаданноеБулево = Не ЗаданноеБулево;
//Сообщить(ЗаданноеБулево);

//Сообщить(КонецМесяца(ТекущаяДата()));
//Сообщить(ДобавитьМесяц(ТекущаяДата(),3));






