
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ЗработнаяПлата
	Движения.ЗработнаяПлата.Записывать = Истина;
	Движение = Движения.ЗработнаяПлата.Добавить();
	Движение.Сторно = Ложь;
	Движение.ВидРасчета = ПланыВидовРасчета.Начисления.Премия;
	Движение.ПериодДействияНачало = НачалоМесяца(Дата);
	Движение.ПериодДействияКонец = КонецМесяца(Дата);
	Движение.ПериодРегистрации = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.РасчетныеДанные = Процент;  
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗработнаяПлатаБазаЗработнаяПлата.СуммаБаза,
		|	ЗработнаяПлатаБазаЗработнаяПлата.РасчетныеДанные
		|ИЗ
		|	РегистрРасчета.ЗработнаяПлата.БазаЗработнаяПлата(&Измерения, &Измерения, , Регистратор = &Ссылка) КАК ЗработнаяПлатаБазаЗработнаяПлата";
	
	
	Измерения = Новый Массив;  
	Измерения.Добавить("Сотрудник");
	
	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой()Тогда
		
			
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();   
		
		Движение.Сумма = ВыборкаДетальныеЗаписи.СуммаБаза * ВыборкаДетальныеЗаписи.РасчетныеДанные / 100;
		Движения.ЗработнаяПлата.Записать();
		
	КонецЕсли;

КонецПроцедуры
